src/Documents/Контракт/Контракт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Контракт</name>
  <comment>Контракты, договоры, коммерческие предложения</comment>
  <registerRecords>InformationRegister.КонтрактыСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныПредметовСнабжения</registerRecords>
  <registerRecords>InformationRegister.ТКПСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныДЗО</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТоргов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияКП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидыКонтрактов/ВидыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрактов</name>
  <enumValues>
    <name>КонтрактСЗаказчиком</name>
  </enumValues>
  <enumValues>
    <name>КонтрактСПоставщиком</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Контракт/Forms/ФормаСписка/Module.bsl
////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимость(РежимВыбора)
	РольПредставительСтроителяКорабля 		= РольДоступна("ПредставительСтроителяКорабля");
	РольПредставительКонтрагента 			= РольДоступна("ПредставительКонтрагента");
	РольПолныеПрава 						= РольДоступна("ПолныеПрава");
	РольСпециалистБлокаЗакупок 				= РольДоступна("СпециалистБлокаЗакупок");
	РольПредставительДЗОИсполнителяЗаявки 	= РольДоступна("ПредставительДЗОИсполнителяЗаявки");
	ПравоДобавление 						= ПравоДоступа("Добавление", Метаданные.Документы.Контракт);
	ПравоВзаимодействиеСРОЭ 				= ПравоДоступа("ИнтерактивныйСтарт", Метаданные.БизнесПроцессы.ВзаимодействиеСРОЭ);
	
	// Блок "Создать"
	Элементы.ФормаСоздать.Видимость						= Не РежимВыбора И ПравоДобавление;	
	Элементы.ФормаСоздатьСЗаказчиком.Видимость 			= Не РольПредставительСтроителяКорабля Или Не РольПредставительКонтрагента;
	
	// Блок "Создать по заявкам"
	Элементы.СоздатьПоЗаявкам.Видимость 				= (РольПолныеПрава Или РольСпециалистБлокаЗакупок Или РольПредставительКонтрагента Или РольПредставительДЗОИсполнителяЗаявки) И Не РежимВыбора;
	Элементы.ФормаСоздатьТКПСЗаказчиком.Видимость 		= Не РольПредставительДЗОИсполнителяЗаявки;
	Элементы.ФормаСоздатьКонтрактСЗаказчиком.Видимость 	= Не РольПредставительДЗОИсполнителяЗаявки;
	Если РольПредставительДЗОИсполнителяЗаявки Тогда
		ИсполнителиДЗО.ЗагрузитьЗначения(ОбщиеФункцииПривилегированный.ПолучитьЗначениеДоступа(ПараметрыСеанса.ТекущийПользователь));
	КонецЕсли; // Если РольПредставительДЗОИсполнителяЗаявки Тогда
	
	// Блок "Отправить"
	Элементы.Отправить.Видимость 						= Не (РольПредставительСтроителяКорабля Или РольПредставительКонтрагента) И Не РежимВыбора И ПравоВзаимодействиеСРОЭ;
	
	// Режим выбора
	Элементы.Список.РежимВыбора 			= РежимВыбора;
	Элементы.ФормаВыбрать.Видимость 		= РежимВыбора;
	Элементы.ФормаВыбрать.КнопкаПоУмолчанию = РежимВыбора;
КонецПроцедуры // УстановитьВидимость

&НаСервереБезКонтекста
Функция ПолучитьВидКонтракта(ВидКонтракта)	
	Возврат Перечисления.ВидыКонтрактов[ВидКонтракта];	
КонецФункции // ПолучитьВидКонтракта

&НаСервере
Процедура УстановитьОтборПоЗаявкам(ЗаявкаЗапрос)
	
	МассивЗаявок = Новый Массив;
	Если ТипЗнч(ЗаявкаЗапрос) = Тип("ДокументСсылка.ЗапросТКПRFP") Тогда		
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= "ВЫБРАТЬ
		             	  |	Заявка.Ссылка КАК Ссылка
		             	  |ИЗ
		             	  |	Документ.Заявка КАК Заявка
		             	  |ГДЕ
		             	  |	Заявка.ЗапросТКПRFP = &ЗапросТКПRFP";
		Запрос.УстановитьПараметр("ЗапросТКПRFP", ЗаявкаЗапрос);
		МассивЗаявок 	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");		
	Иначе
		МассивЗаявок.Добавить(ЗаявкаЗапрос);		
	КонецЕсли; // Если ТипЗнч(ЗаявкаЗапрос) = Тип("ДокументСсылка.ЗапросТКПRFP") Тогда
	
	Список.ТекстЗапроса = Список.ТекстЗапроса + " ГДЕ ДокументКонтракт.ПредметыСнабжения.Заявка В(&СписокЗаявок)";	
	Список.Параметры.УстановитьЗначениеПараметра("СписокЗаявок", МассивЗаявок);
КонецПроцедуры // УстановитьОтборПоЗаявкам

&НаКлиенте
Процедура ОткрытьПодборПозицийЗаявок(ПараметрыОткрытия)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикПодбораПозицийЗаявок", 
														Этотобъект, 
														ПараметрыОткрытия);	
	ОткрытьФорму("Документ.Контракт.Форма.ФормаПодбораПозицийЗаявок", 
														ПараметрыОткрытия, 
														ЭтотОбъект,,,, 
														ОписаниеОповещения, 
														РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры // ОткрытьПодборПозицийЗаявок()

&НаКлиенте
Процедура ОбработчикПодбораПозицийЗаявок(АдресВременногоХранилища, ДопПараметры) Экспорт

	Если Не АдресВременногоХранилища = Неопределено Тогда
		
		ДопПараметры.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
		
		Если ДопПараметры.Свойство("ТКПСПоставщиком") Тогда
			
			ДопПараметры.Вставить("ВидКонтракта", ПолучитьВидКонтракта("КонтрактСПоставщиком")); 
			ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСПоставщиком", ДопПараметры);	
			
		ИначеЕсли ДопПараметры.Свойство("ТКПСЗаказчиком") Тогда
			
			ДопПараметры.Вставить("ВидКонтракта",ПолучитьВидКонтракта("КонтрактСЗаказчиком"));
			ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСЗаказчиком", ДопПараметры);	
			
		ИначеЕсли ДопПараметры.Свойство("КонтрактСЗаказчиком") Тогда
			
			ДопПараметры.Вставить("ВидКонтракта",ПолучитьВидКонтракта("КонтрактСЗаказчиком"));
			ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСЗаказчиком", ДопПараметры);	
			
		КонецЕсли; 
		
	КонецЕсли;	

КонецПроцедуры // ОбработчикПодбораПозицийЗаявок()

&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДокОбъект, ДокСсылка)
	
	ВзаимодействиеСРОЭ.ЗаполнитьДанныеНаСервере(ДокОбъект, ДокСсылка);
	ДокОбъект.ВариантЗаполнения = 3;
	
КонецПроцедуры

////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура СоздатьТКПСПоставщиком(Команда)
	
	ПараметрыОткрытия = Новый Структура("ТКПСПоставщиком");
	
	Если ИсполнителиДЗО.Количество() > 0 Тогда
		ПараметрыОткрытия.Вставить("ИсполнительДЗО", ИсполнителиДЗО.ВыгрузитьЗначения());
	КонецЕсли; 
	
	ОткрытьПодборПозицийЗаявок(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТКПСЗаказчиком(Команда)
	
	ПараметрыОткрытия = Новый Структура("ТКПСЗаказчиком");
	ОткрытьПодборПозицийЗаявок(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрактСЗаказчиком(Команда)
	
	ПараметрыОткрытия = Новый Структура("КонтрактСЗаказчиком");
	ОткрытьПодборПозицийЗаявок(ПараметрыОткрытия);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСПоставщиком(Команда)
	
	ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСПоставщиком", Новый Структура("ВидКонтракта", ПолучитьВидКонтракта("КонтрактСПоставщиком")));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСЗаказчиком(Команда)
	
	ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСЗаказчиком", Новый Структура("ВидКонтракта", ПолучитьВидКонтракта("КонтрактСЗаказчиком")));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРОЭ(Команда)
	
	ФормаБП = ПолучитьФорму("БизнесПроцесс.ВзаимодействиеСРОЭ.Форма.ФормаБизнесПроцесса");
    ДокОбъект = ФормаБП.Объект;
	
	ДокСсылка = Элементы.Список.ТекущаяСтрока;

	ЗаполнитьДанныеНаСервере(ДокОбъект, ДокСсылка);
    КопироватьДанныеФормы(ДокОбъект, ФормаБП.Объект);
	
	ФормаБП.Открыть();
		
КонецПроцедуры

////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость(Параметры.РежимВыбора);		
	
	Если Параметры.Свойство("ЗаявкаЗапрос") Тогда		
		УстановитьОтборПоЗаявкам(Параметры.ЗаявкаЗапрос);		
	КонецЕсли; // Если Параметры.Свойство("ЗаявкаЗапрос") Тогда	
	
КонецПроцедуры // ПриСозданииНаСервере
